# JoinedRoofMissesTargetError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..JoinedRoofMissesTargetError Property
BuiltInFailures..::..RoofFailures Class See Also
---
Part of the roof to be joined misses the target face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId JoinedRoofMissesTargetError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoinedRoofMissesTargetError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ JoinedRoofMissesTargetError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace